perf/busySleep.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 20
      arrivalRate: 0
    - name: Plain
      duration: 120
      arrivalRate: 5
    - name: Plain
      duration: 120
      arrivalRate: 10
    - name: Plain
      duration: 120
      arrivalRate: 15
    - name: Plain
      duration: 120
      arrivalRate: 20
    - name: Plain
      duration: 120
      arrivalRate: 1

scenarios:
  - name: Root (/BusySleep)
    flow:
      - get:
          url: '/BusySleep/'